src/cfe/Catalogs/кбп_Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кбп_Процессы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСхемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СостоянияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагРодителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдМаркераРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньВложенности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.кбп_ПеременныеПроцессов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/кбп_Процессы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Процесс запускается из «Мои задачи» → «Запустить процесс» или из конструктора схем.'");
	КонецЕсли;
	ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрерватьПроцесс(Команда)

	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПрерватьЗавершение", ЭтотОбъект), ,
		НСтр("ru = 'Причина прерывания процесса'"), , Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)

	Если Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Напишите комментарий.'"), , "Комментарий");
		Возврат;
	КонецЕсли;
	ДобавитьКомментарийНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрерватьЗавершение(Причина, ДополнительныеПараметры) Экспорт

	Если Причина = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПрерватьНаСервере(Причина);
	Оповестить("кбп_ИзменениеЗадачи", Объект.Ссылка);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Процесс прерван'"), , Строка(Объект.Ссылка));

КонецПроцедуры

&НаСервере
Процедура ПрерватьНаСервере(Причина)
	кбп_ПроцессыAPI.ПрерватьПроцесс(Объект.Ссылка, Причина);
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийНаСервере()
	кбп_ПроцессыAPI.ДобавитьКомментарий(Объект.Ссылка, Комментарий);
	Комментарий = "";
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	Заголовок = СтрШаблон(НСтр("ru = 'Процесс: %1'"), Объект.Наименование);
	Элементы.ФормаПрерватьПроцесс.Доступность = кбп_Движок.МожноУправлятьПроцессом(Объект.Ссылка)
		И (Объект.Состояние = Перечисления.кбп_СостоянияПроцессов.Активен
			Или Объект.Состояние = Перечисления.кбп_СостоянияПроцессов.Приостановлен
			Или Объект.Состояние = Перечисления.кбп_СостоянияПроцессов.Ошибка);
	Элементы.СтраницаПеременные.Видимость = Объект.Переменные.Количество() > 0;

	Задачи.Очистить();
	Для Каждого СтрокаЗадачи Из кбп_Движок.ЗадачиПроцесса(Объект.Ссылка) Цикл
		ЗаполнитьЗначенияСвойств(Задачи.Добавить(), СтрокаЗадачи);
	КонецЦикла;

	Журнал.Очистить();
	Для Каждого Запись Из кбп_Движок.ЖурналПроцесса(Объект.Ссылка) Цикл
		ЗаполнитьЗначенияСвойств(Журнал.Добавить(), Запись);
	КонецЦикла;

	ПоказатьСхему();

КонецПроцедуры

// Схема версии с подсветкой: пройденные шаги — зелёные, текущие — жёлтые (ФТ-110).
&НаСервере
Процедура ПоказатьСхему()

	ГрафСхема = кбп_КомпиляторСхем.ГрафическаяСхемаВерсии(Объект.ВерсияСхемы);
	Состояния = кбп_Движок.СостоянияШаговПроцесса(Объект.Ссылка);
	Пройденный = Новый Цвет(200, 235, 200);
	Текущий = Новый Цвет(255, 230, 150);
	Для Каждого ЭлементСхемы Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
		Состояние = Состояния[ЭлементСхемы.Имя];
		Если Состояние = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ЭлементСхемы.ЦветФона = ?(Состояние = "Текущий", Текущий, Пройденный);
		Исключение
			// У элементов этого вида нет цвета фона — оставляем как есть.
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
